import type React from 'react';
import './FoundationMission.scss';

export const FoundationMission: React.FC = () => {
  return (
    <section className="mission">
      <div className="mission__texts">
        <p className="mission__text mission__text--first">
          Ідея створення Благодійного фонду народилася з материнської любові та віри мами Михайла.
          За життя Михайло невпинно навчався, займався науковою діяльністю, прагнув особистого й
          професійного розвитку та завжди знаходив час, аби підтримати інших. Допомога людям була
          для нього не обов’язком, а внутрішньою потребою.
        </p>

        <p className="mission__text mission__text--second-temp">
          Створюючи цей фонд, ми продовжуємо шлях Михайла — шлях турботи, підтримки й віри в людей,
          а також втілюємо його цінності: людяність, відповідальність і небайдужість. Наша мета —
          допомагати тим, хто опинився у складних життєвих обставинах і не має достатніх можливостей
          для навчання, розвитку чи гідного життя. Ми віримо, що навіть невелика допомога здатна
          змінити долю, а спільними зусиллями можна подарувати надію, шанс і майбутнє.
        </p>
      </div>

      <img
        className="mission__img"
        src="./images/foundation-mission.webp"
        alt="Foundation mission image"
      />

      <p className="mission__text mission__text--second">
        Створюючи цей фонд, ми продовжуємо шлях Михайла — шлях турботи, підтримки й віри в людей, а
        також втілюємо його цінності: людяність, відповідальність і небайдужість. Наша мета —
        допомагати тим, хто опинився у складних життєвих обставинах і не має достатніх можливостей
        для навчання, розвитку чи гідного життя. Ми віримо, що навіть невелика допомога здатна
        змінити долю, а спільними зусиллями можна подарувати надію, шанс і майбутнє.
      </p>
    </section>
  );
};
