import type { SwiperImage } from '../../types';
import type { Verse } from './types';

export const paintings: SwiperImage[] = [
  {
    src: './images/painting1.webp',
    alt: 'Картина №1',
  },
  {
    src: './images/painting2.webp',
    alt: 'Картина №2',
  },
  {
    src: './images/painting3.webp',
    alt: 'Картина №3',
  },
];

export const verses: Verse[] = [
  {
    paragraphs: [
      `Вовкулака срібний
      із золотими очима.
      В пащі стріли, тримаючи,
      Немає страхів та докорів,
      Бо ворогів треба нищити,
      Нищити доки не буде жодного
      на нашій рідній землі…
      Сили Спеціальних Операцій…
      Жах на ворогів, наганяючи,
      Бо невідомо, де на них
      чигатиме смерть
      від доблесті та світла стріл
      воїнів наших славних…
      Нащадки Святослава Хороброго,
      Що незалежність боронять,
      Що у борні, прославляючи
      Ідею Держави нашої,
      Нескореної, мужньої, сильної
      Тримають у вірі Величній`,

      `Божій і нескоримій,
      Разом із Духом Свободи
      та серцями полум’яними
      Захисників, захисниць…
      І козаки-характерники,
      Що силою духу, творячи,
      В образах непізнаних ворогові,
      Стріли руками, ловлячи,
      Передають естафету
      Нашим захисникам
      Звідти – з Небес
      Даруючи
      їм сил і славу минулую,
      Душам натхненним
      до бою…
      До перемоги і світла,
      Що осяває шлях
      Нашої України.`,
    ],
    author: 'Автор: Василь Дяків, 28.09.2025 р.',
  },
  {
    paragraphs: [
      `Мама хоронить сина…
      Рідну кровиночку… плаче небога.
      Не в землю сиру хоронить:
      Смиренно передає до Бога.
      Біль не сказати просто словами,
      Сльозами не змити у цю годину.
      Чи можна забрати горе від мами,
      Що птахою припада до домовини?!
      Героєм загинув, мужньо боровся
      Із ворогами своєї Вкраїни.
      Боже, дай щоб втрата оця - не марна,
      Як загинули син її й побратими.
      Скільки синів вже злетіло в небо!
      Вірю: навідають рідну домівку.
      Журавликом, хмаркою, а чи метеликом…
      Пам’ять про них хай буде довіку!`,
    ],
    author: 'Автор: Н. Сопилюк, 09.07.2025 р.',
  },
];
