import type React from 'react';
import './Childhood.scss';

export const Childhood: React.FC = () => {
  return (
    <section id="childhood" className="childhood">
      <div className="childhood__section">
        <h3 className="childhood__title">Дитинство</h3>
      </div>

      <div className="childhood__section">
        <img className="childhood__img" src="./images/childhood.webp" alt="Childhood photo №1" />

        <div className="childhood__text-wrapper">
          <p>
            Народився Михайло в теплу весняну пору, коли довкола буяло розмаїття життя і цвіту, 5
            травня 1998 року в Заліщиках Тернопільської області. Своїм голосним криком він сповістив
            світ про народження активної, сильної, доброї, впевненої у своїх силах, харизматичної
            людини-патріота.
          </p>

          <p>
            У 2004 році переступив поріг спеціалізованої школи І-ІІІ ступенів імені О.Маковея м.
            Заліщики, маючи мету бути одним із кращих. Упродовж 2008-2015 років здобував освіту в
            Заліщицькій державній гімназії, був членом наукового товариства гімназії «Пошук», а
            згодом – слухачем Тернопільського відділення Малої академії наук України. Писав і
            захищав науково-дослідницькі роботи у секціях «Історія України» та «Правознавство», брав
            участь в олімпіаді з правознавства, здобуваючи призові місця.
          </p>
        </div>
      </div>

      <div className="childhood__section">
        <img
          className="childhood__img childhood__img--wide"
          src="./images/childhood-wide.webp"
          alt="Childhood photo №2"
        />

        <div className="childhood__text-wrapper">
          <p>
            Змалечку Михайлик любив слухати легенди, перекази, історичні оповіді, що пізніше
            переросло в неймовірне захоплення історією України та юриспруденцією. Тричі брав участь
            у Всеукраїнському історичному конкурсі «Непізнана історія мого краю», Всеукраїнській
            пошуковій історико-краєзнавчій експедиції МАН України «Кам’яні свідки минулих століть»,
            Всеукраїнській історико-краєзнавчій акції учнівської та студентської молоді «А ми тую
            славу збережемо», Всеукраїнській конференції учнівської молоді, присвяченій 70-ій
            річниці визволення України від фашистських загарбників, у Міжнародному конкурсі «Барви
            Дністра», Міжнародному фестивалі-конкурсі дитячо-юнацької журналістики «Прес-весна на
            Дніпрових схилах», Міжнародному учнівському конкурсі юних істориків «Лелека», де
            постійно займав призові місця.
          </p>
        </div>
      </div>
    </section>
  );
};
